/* hw9_9.c */
#include <stdio.h>
#include <stdlib.h>
int main(void)
{    
   int i,j,sale[2][4],sum[4]={0};
   
   for(i=0;i<2;i++)
      for(j=0;j<4;j++)
      {
         printf("業務員%d的第%d季業績:",i+1,j+1); 
         scanf("%d",&sale[i][j]);
      }
  
   printf("***Output***");
   for(i=0;i<2;i++)
   {
      printf("\n業務員%d的業績分別為",i+1); 
      for(j=0;j<4;j++)
      {
         printf("%d ",sale[i][j]); 
         sum[j]+=sale[i][j];
      }
   }
   printf("\n\n");
   for(i=0;i<4;i++)
      printf("第%d季的銷售量為%d部車\n",i+1,sum[i]);
    
   system("pause");
   return 0;
}

/* output------------------------
業務員1的第1季業績:30
業務員1的第2季業績:35
業務員1的第3季業績:26
業務員1的第4季業績:32
業務員2的第1季業績:33
業務員2的第2季業績:34
業務員2的第3季業績:30
業務員2的第4季業績:29
***Output***
業務員1的業績分別為30 35 26 32
業務員2的業績分別為33 34 30 29

第1季的銷售量為63部車
第2季的銷售量為69部車
第3季的銷售量為56部車
第4季的銷售量為61部車
-------------------------------*/
